tutorial/softwood/beech(Grønli2002)/RACHC/0/save/a
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "90";
    object      a;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   uniform 0.5;

boundaryField
{
    WALL
    {
        type            calculated;
        value           uniform 0.5;
    }
    INLET
    {
        type            calculated;
        value           uniform 0.5;
    }
    OUTLET
    {
        type            calculated;
        value           uniform 0.5;
    }
}


// ************************************************************************* //
